package test_20250120;

public class study3_20250121 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 연산자 
	}

}

//연산자
/*
	사칙연산자 : -, +, *, /(나누기_몫값 출력), %(나누기_나머지값 출력)
	대입 연산자 : - = (오른쪽에서 왼쪽에 대입 - 저장)
	증감 연산자 : ++, -- 
	복합 대입 연산자 : += , -= , *=, /=, %= (연산을 해서 왼쪽에 저장해라.)
	비교연산자 : >, <, >=, <=, ==(꼭 두 개로 표시_같다는 의미), !=
	논리연산자 : &&(and), ||(or_\키), !(not)
	조건연산자(삼항연산자) : (조건식) ? (참일 경우 실행내용:) or (거짓일 경우 실행내용:)
	
	비트연산자 (2진수 계산용) 
		비트 논리연산자 : &, |, ~, ^ (비트연산자에서는 한 번씩만 입력)
		비트 쉬프트 연산자 : << , >> 

*/